Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 728, ICM Interrupt Group MCS 2 for Channel Interrupt Information */
#define GTM_ICM_IRQG_CI_MCS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_MCS*)0xF0100728u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_MCS2.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_MCS2.
*/
#define GTM_ICM_IRQG_MCS2_CI (GTM_ICM_IRQG_CI_MCS2)

/** \brief 72C, ICM Interrupt Group MCS 3 for Channel Interrupt Information */
#define GTM_ICM_IRQG_CI_MCS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_MCS*)0xF010072Cu)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_MCS3.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_MCS3.
*/
#define GTM_ICM_IRQG_MCS3_CI (GTM_ICM_IRQG_CI_MCS3)

/** \brief 730, ICM Interrupt Group MCS 4 for Channel Interrupt Information */
#define GTM_ICM_IRQG_CI_MCS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_MCS*)0xF0100730u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_MCS4.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_MCS4.
*/
#define GTM_ICM_IRQG_MCS4_CI (GTM_ICM_IRQG_CI_MCS4)

/** \brief 734, ICM Interrupt Group MCS 5 for Channel Interrupt Information */
#define GTM_ICM_IRQG_CI_MCS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_MCS*)0xF0100734u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_MCS5.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_MCS5.
*/
#define GTM_ICM_IRQG_MCS5_CI (GTM_ICM_IRQG_CI_MCS5)

/** \brief 738, ICM Interrupt Group MCS 6 for Channel Interrupt Information */
#define GTM_ICM_IRQG_CI_MCS6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_MCS*)0xF0100738u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_MCS6.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_MCS6.
*/
#define GTM_ICM_IRQG_MCS6_CI (GTM_ICM_IRQG_CI_MCS6)

/** \brief 760, ICM Interrupt Group PSM 0 for Channel Interrupt Information of FIFO0, FIFO1, FIFO2 */
#define GTM_ICM_IRQG_CI_PSM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_PSM*)0xF0100760u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_PSM0.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_PSM0.
*/
#define GTM_ICM_IRQG_PSM_0_CI (GTM_ICM_IRQG_CI_PSM0)

/** \brief 770, ICM Interrupt Group SPE for Module Interrupt Information */
#define GTM_ICM_IRQG_CI_SPE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_SPE*)0xF0100770u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_SPE.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_SPE.
*/
#define GTM_ICM_IRQG_SPE_CI (GTM_ICM_IRQG_CI_SPE)

/** \brief 790, ICM Interrupt Group ATOM 0 for Channel Interrupt Information of ATOMm */
#define GTM_ICM_IRQG_CI_ATOM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_ATOM*)0xF0100790u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_ATOM0.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_ATOM0.
*/
#define GTM_ICM_IRQG_ATOM_0_CI (GTM_ICM_IRQG_CI_ATOM0)

/** \brief 794, ICM Interrupt Group ATOM 1 for Channel Interrupt Information of ATOMm */
#define GTM_ICM_IRQG_CI_ATOM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_ATOM*)0xF0100794u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_ATOM1.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_ATOM1.
*/
#define GTM_ICM_IRQG_ATOM_1_CI (GTM_ICM_IRQG_CI_ATOM1)

/** \brief 798, ICM Interrupt Group ATOM 2 for Channel Interrupt Information of ATOMm */
#define GTM_ICM_IRQG_CI_ATOM2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_ATOM*)0xF0100798u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_ATOM2.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_ATOM2.
*/
#define GTM_ICM_IRQG_ATOM_2_CI (GTM_ICM_IRQG_CI_ATOM2)

/** \brief 7A0, ICM Interrupt Group TOM 0 for Channel Interrupt Information of TOMm */
#define GTM_ICM_IRQG_CI_TOM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_TOM*)0xF01007A0u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_TOM0.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_TOM0.
*/
#define GTM_ICM_IRQG_TOM_0_CI (GTM_ICM_IRQG_CI_TOM0)

/** \brief 7A4, ICM Interrupt Group TOM 1 for Channel Interrupt Information of TOMm */
#define GTM_ICM_IRQG_CI_TOM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_TOM*)0xF01007A4u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_TOM1.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_TOM1.
*/
#define GTM_ICM_IRQG_TOM_1_CI (GTM_ICM_IRQG_CI_TOM1)

/** \brief 7A8, ICM Interrupt Group TOM 2 for Channel Interrupt Information of TOMm */
#define GTM_ICM_IRQG_CI_TOM2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CI_TOM*)0xF01007A8u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CI_TOM2.
* To use register names with standard convension, please use GTM_ICM_IRQG_CI_TOM2.
*/
#define GTM_ICM_IRQG_TOM_2_CI (GTM_ICM_IRQG_CI_TOM2)

/** \brief 800, SPE0 Control Status Register */
#define GTM_SPE0_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT*)0xF0100800u)

/** \brief 804, SPE0 Input Pattern Definition Register */
#define GTM_SPE0_PAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_PAT*)0xF0100804u)

/** \brief 808, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100808u)

/** \brief 80C, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010080Cu)

/** \brief 810, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100810u)

/** \brief 814, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100814u)

/** \brief 818, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100818u)

/** \brief 81C, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010081Cu)

/** \brief 820, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100820u)

/** \brief 824, SPE0 Output Definition Register z */
#define GTM_SPE0_OUT_PAT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100824u)

/** \brief 828, SPE0 Output Control Register */
#define GTM_SPE0_OUT_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL*)0xF0100828u)

/** \brief 82C, SPE0 Interrupt Notification Register */
#define GTM_SPE0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY*)0xF010082Cu)

/** \brief 830, SPE0 Interrupt Enable Register */
#define GTM_SPE0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN*)0xF0100830u)

