Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 32B0, TIM4 Channel 5 Interrupt Enable Register */
#define GTM_TIM4_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01032B0u)

/** \brief 32B4, TIM4 Channel 5 Force Interrupt Register */
#define GTM_TIM4_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01032B4u)

/** \brief 32B8, TIM4 Channel 5 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01032B8u)

/** \brief 32BC, TIM4 Channel 5 Error Interrupt Enable Register */
#define GTM_TIM4_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01032BCu)

/** \brief 3300, TIM4 Channel 6 General Purpose 0 Register */
#define GTM_TIM4_CH6_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103300u)

/** \brief 3304, TIM4 Channel 6 General Purpose 1 Register */
#define GTM_TIM4_CH6_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103304u)

/** \brief 3308, TIM4 Channel 6 SMU Counter Register */
#define GTM_TIM4_CH6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103308u)

/** \brief 330C, TIM4 Channel 6 SMU Edge Counter Register */
#define GTM_TIM4_CH6_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010330Cu)

/** \brief 3310, TIM4 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM4_CH6_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103310u)

/** \brief 3314, TIM4 Channel 6 TDU Counter Register */
#define GTM_TIM4_CH6_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103314u)

/** \brief 3318, TIM4 Channel 6 TDU Control Register */
#define GTM_TIM4_CH6_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103318u)

/** \brief 331C, TIM4 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM4_CH6_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010331Cu)

/** \brief 3320, TIM4 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM4_CH6_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103320u)

/** \brief 3324, TIM4 Channel 6 Control Register */
#define GTM_TIM4_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103324u)

/** \brief 3328, TIM4 Channel 6 Extended Control Register */
#define GTM_TIM4_CH6_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103328u)

/** \brief 332C, TIM4 Channel 6 Interrupt Notification Register */
#define GTM_TIM4_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010332Cu)

/** \brief 3330, TIM4 Channel 6 Interrupt Enable Register */
#define GTM_TIM4_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103330u)

/** \brief 3334, TIM4 Channel 6 Force Interrupt Register */
#define GTM_TIM4_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103334u)

/** \brief 3338, TIM4 Channel 6 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103338u)

/** \brief 333C, TIM4 Channel 6 Error Interrupt Enable Register */
#define GTM_TIM4_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010333Cu)

/** \brief 3380, TIM4 Channel 7 General Purpose 0 Register */
#define GTM_TIM4_CH7_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103380u)

/** \brief 3384, TIM4 Channel 7 General Purpose 1 Register */
#define GTM_TIM4_CH7_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103384u)

/** \brief 3388, TIM4 Channel 7 SMU Counter Register */
#define GTM_TIM4_CH7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103388u)

/** \brief 338C, TIM4 Channel 7 SMU Edge Counter Register */
#define GTM_TIM4_CH7_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010338Cu)

/** \brief 3390, TIM4 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM4_CH7_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103390u)

/** \brief 3394, TIM4 Channel 7 TDU Counter Register */
#define GTM_TIM4_CH7_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103394u)

/** \brief 3398, TIM4 Channel 7 TDU Control Register */
#define GTM_TIM4_CH7_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103398u)

/** \brief 339C, TIM4 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM4_CH7_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010339Cu)

/** \brief 33A0, TIM4 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM4_CH7_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01033A0u)

/** \brief 33A4, TIM4 Channel 7 Control Register */
#define GTM_TIM4_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01033A4u)

/** \brief 33A8, TIM4 Channel 7 Extended Control Register */
#define GTM_TIM4_CH7_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01033A8u)

/** \brief 33AC, TIM4 Channel 7 Interrupt Notification Register */
#define GTM_TIM4_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01033ACu)

/** \brief 33B0, TIM4 Channel 7 Interrupt Enable Register */
#define GTM_TIM4_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01033B0u)

/** \brief 33B4, TIM4 Channel 7 Force Interrupt Register */
#define GTM_TIM4_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01033B4u)

/** \brief 33B8, TIM4 Channel 7 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01033B8u)

/** \brief 33BC, TIM4 Channel 7 Error Interrupt Enable Register */
#define GTM_TIM4_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01033BCu)

/** \brief 3800, TIM5 Channel 0 General Purpose 0 Register */
#define GTM_TIM5_CH0_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103800u)

/** \brief 3804, TIM5 Channel 0 General Purpose 1 Register */
#define GTM_TIM5_CH0_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103804u)

/** \brief 3808, TIM5 Channel 0 SMU Counter Register */
#define GTM_TIM5_CH0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103808u)

/** \brief 380C, TIM5 Channel 0 SMU Edge Counter Register */
#define GTM_TIM5_CH0_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010380Cu)

