Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 3810, TIM5 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM5_CH0_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103810u)

/** \brief 3814, TIM5 Channel 0 TDU Counter Register */
#define GTM_TIM5_CH0_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103814u)

/** \brief 3818, TIM5 Channel 0 TDU Control Register */
#define GTM_TIM5_CH0_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103818u)

/** \brief 381C, TIM5 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM5_CH0_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010381Cu)

/** \brief 3820, TIM5 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM5_CH0_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103820u)

/** \brief 3824, TIM5 Channel 0 Control Register */
#define GTM_TIM5_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103824u)

/** \brief 3828, TIM5 Channel 0 Extended Control Register */
#define GTM_TIM5_CH0_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103828u)

/** \brief 382C, TIM5 Channel 0 Interrupt Notification Register */
#define GTM_TIM5_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010382Cu)

/** \brief 3830, TIM5 Channel 0 Interrupt Enable Register */
#define GTM_TIM5_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103830u)

/** \brief 3834, TIM5 Channel 0 Force Interrupt Register */
#define GTM_TIM5_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103834u)

/** \brief 3838, TIM5 Channel 0 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103838u)

/** \brief 383C, TIM5 Channel 0 Error Interrupt Enable Register */
#define GTM_TIM5_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010383Cu)

/** \brief 3874, TIM5 Input Value Observation Register */
#define GTM_TIM5_INP_VAL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_INP_VAL*)0xF0103874u)

/** \brief 3878, TIM5 AUX IN Source Selection Register */
#define GTM_TIM5_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_IN_SRC*)0xF0103878u)

/** \brief 387C, TIM5 Global Software Reset Register */
#define GTM_TIM5_RST /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_RST*)0xF010387Cu)

/** \brief 3880, TIM5 Channel 1 General Purpose 0 Register */
#define GTM_TIM5_CH1_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103880u)

/** \brief 3884, TIM5 Channel 1 General Purpose 1 Register */
#define GTM_TIM5_CH1_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103884u)

/** \brief 3888, TIM5 Channel 1 SMU Counter Register */
#define GTM_TIM5_CH1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103888u)

/** \brief 388C, TIM5 Channel 1 SMU Edge Counter Register */
#define GTM_TIM5_CH1_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010388Cu)

/** \brief 3890, TIM5 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM5_CH1_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103890u)

/** \brief 3894, TIM5 Channel 1 TDU Counter Register */
#define GTM_TIM5_CH1_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103894u)

/** \brief 3898, TIM5 Channel 1 TDU Control Register */
#define GTM_TIM5_CH1_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103898u)

/** \brief 389C, TIM5 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM5_CH1_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010389Cu)

/** \brief 38A0, TIM5 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM5_CH1_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01038A0u)

/** \brief 38A4, TIM5 Channel 1 Control Register */
#define GTM_TIM5_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01038A4u)

/** \brief 38A8, TIM5 Channel 1 Extended Control Register */
#define GTM_TIM5_CH1_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01038A8u)

/** \brief 38AC, TIM5 Channel 1 Interrupt Notification Register */
#define GTM_TIM5_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01038ACu)

/** \brief 38B0, TIM5 Channel 1 Interrupt Enable Register */
#define GTM_TIM5_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01038B0u)

/** \brief 38B4, TIM5 Channel 1 Force Interrupt Register */
#define GTM_TIM5_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01038B4u)

/** \brief 38B8, TIM5 Channel 1 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01038B8u)

/** \brief 38BC, TIM5 Channel 1 Error Interrupt Enable Register */
#define GTM_TIM5_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01038BCu)

/** \brief 3900, TIM5 Channel 2 General Purpose 0 Register */
#define GTM_TIM5_CH2_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103900u)

/** \brief 3904, TIM5 Channel 2 General Purpose 1 Register */
#define GTM_TIM5_CH2_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103904u)

/** \brief 3908, TIM5 Channel 2 SMU Counter Register */
#define GTM_TIM5_CH2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103908u)

/** \brief 390C, TIM5 Channel 2 SMU Edge Counter Register */
#define GTM_TIM5_CH2_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010390Cu)

/** \brief 3910, TIM5 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM5_CH2_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103910u)

/** \brief 3914, TIM5 Channel 2 TDU Counter Register */
#define GTM_TIM5_CH2_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103914u)

/** \brief 3918, TIM5 Channel 2 TDU Control Register */
#define GTM_TIM5_CH2_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103918u)

/** \brief 391C, TIM5 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM5_CH2_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010391Cu)

