Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 4188, TIM6 Channel 3 SMU Counter Register */
#define GTM_TIM6_CH3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104188u)

/** \brief 418C, TIM6 Channel 3 SMU Edge Counter Register */
#define GTM_TIM6_CH3_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010418Cu)

/** \brief 4190, TIM6 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM6_CH3_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104190u)

/** \brief 4194, TIM6 Channel 3 TDU Counter Register */
#define GTM_TIM6_CH3_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104194u)

/** \brief 4198, TIM6 Channel 3 TDU Control Register */
#define GTM_TIM6_CH3_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104198u)

/** \brief 419C, TIM6 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM6_CH3_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010419Cu)

/** \brief 41A0, TIM6 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM6_CH3_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01041A0u)

/** \brief 41A4, TIM6 Channel 3 Control Register */
#define GTM_TIM6_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01041A4u)

/** \brief 41A8, TIM6 Channel 3 Extended Control Register */
#define GTM_TIM6_CH3_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01041A8u)

/** \brief 41AC, TIM6 Channel 3 Interrupt Notification Register */
#define GTM_TIM6_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01041ACu)

/** \brief 41B0, TIM6 Channel 3 Interrupt Enable Register */
#define GTM_TIM6_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01041B0u)

/** \brief 41B4, TIM6 Channel 3 Force Interrupt Register */
#define GTM_TIM6_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01041B4u)

/** \brief 41B8, TIM6 Channel 3 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01041B8u)

/** \brief 41BC, TIM6 Channel 3 Error Interrupt Enable Register */
#define GTM_TIM6_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01041BCu)

/** \brief 4200, TIM6 Channel 4 General Purpose 0 Register */
#define GTM_TIM6_CH4_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104200u)

/** \brief 4204, TIM6 Channel 4 General Purpose 1 Register */
#define GTM_TIM6_CH4_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104204u)

/** \brief 4208, TIM6 Channel 4 SMU Counter Register */
#define GTM_TIM6_CH4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104208u)

/** \brief 420C, TIM6 Channel 4 SMU Edge Counter Register */
#define GTM_TIM6_CH4_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010420Cu)

/** \brief 4210, TIM6 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM6_CH4_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104210u)

/** \brief 4214, TIM6 Channel 4 TDU Counter Register */
#define GTM_TIM6_CH4_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104214u)

/** \brief 4218, TIM6 Channel 4 TDU Control Register */
#define GTM_TIM6_CH4_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104218u)

/** \brief 421C, TIM6 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM6_CH4_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010421Cu)

/** \brief 4220, TIM6 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM6_CH4_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104220u)

/** \brief 4224, TIM6 Channel 4 Control Register */
#define GTM_TIM6_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104224u)

/** \brief 4228, TIM6 Channel 4 Extended Control Register */
#define GTM_TIM6_CH4_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104228u)

/** \brief 422C, TIM6 Channel 4 Interrupt Notification Register */
#define GTM_TIM6_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010422Cu)

/** \brief 4230, TIM6 Channel 4 Interrupt Enable Register */
#define GTM_TIM6_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104230u)

/** \brief 4234, TIM6 Channel 4 Force Interrupt Register */
#define GTM_TIM6_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104234u)

/** \brief 4238, TIM6 Channel 4 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104238u)

/** \brief 423C, TIM6 Channel 4 Error Interrupt Enable Register */
#define GTM_TIM6_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010423Cu)

/** \brief 4280, TIM6 Channel 5 General Purpose 0 Register */
#define GTM_TIM6_CH5_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104280u)

/** \brief 4284, TIM6 Channel 5 General Purpose 1 Register */
#define GTM_TIM6_CH5_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104284u)

/** \brief 4288, TIM6 Channel 5 SMU Counter Register */
#define GTM_TIM6_CH5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104288u)

/** \brief 428C, TIM6 Channel 5 SMU Edge Counter Register */
#define GTM_TIM6_CH5_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010428Cu)

/** \brief 4290, TIM6 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM6_CH5_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104290u)

/** \brief 4294, TIM6 Channel 5 TDU Counter Register */
#define GTM_TIM6_CH5_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104294u)

/** \brief 4298, TIM6 Channel 5 TDU Control Register */
#define GTM_TIM6_CH5_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104298u)

/** \brief 429C, TIM6 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM6_CH5_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010429Cu)

/** \brief 42A0, TIM6 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM6_CH5_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01042A0u)

/** \brief 42A4, TIM6 Channel 5 Control Register */
#define GTM_TIM6_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01042A4u)

/** \brief 42A8, TIM6 Channel 5 Extended Control Register */
#define GTM_TIM6_CH5_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01042A8u)

