Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 42AC, TIM6 Channel 5 Interrupt Notification Register */
#define GTM_TIM6_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01042ACu)

/** \brief 42B0, TIM6 Channel 5 Interrupt Enable Register */
#define GTM_TIM6_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01042B0u)

/** \brief 42B4, TIM6 Channel 5 Force Interrupt Register */
#define GTM_TIM6_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01042B4u)

/** \brief 42B8, TIM6 Channel 5 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01042B8u)

/** \brief 42BC, TIM6 Channel 5 Error Interrupt Enable Register */
#define GTM_TIM6_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01042BCu)

/** \brief 4300, TIM6 Channel 6 General Purpose 0 Register */
#define GTM_TIM6_CH6_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104300u)

/** \brief 4304, TIM6 Channel 6 General Purpose 1 Register */
#define GTM_TIM6_CH6_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104304u)

/** \brief 4308, TIM6 Channel 6 SMU Counter Register */
#define GTM_TIM6_CH6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104308u)

/** \brief 430C, TIM6 Channel 6 SMU Edge Counter Register */
#define GTM_TIM6_CH6_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010430Cu)

/** \brief 4310, TIM6 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM6_CH6_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104310u)

/** \brief 4314, TIM6 Channel 6 TDU Counter Register */
#define GTM_TIM6_CH6_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104314u)

/** \brief 4318, TIM6 Channel 6 TDU Control Register */
#define GTM_TIM6_CH6_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104318u)

/** \brief 431C, TIM6 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM6_CH6_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010431Cu)

/** \brief 4320, TIM6 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM6_CH6_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104320u)

/** \brief 4324, TIM6 Channel 6 Control Register */
#define GTM_TIM6_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104324u)

/** \brief 4328, TIM6 Channel 6 Extended Control Register */
#define GTM_TIM6_CH6_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104328u)

/** \brief 432C, TIM6 Channel 6 Interrupt Notification Register */
#define GTM_TIM6_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010432Cu)

/** \brief 4330, TIM6 Channel 6 Interrupt Enable Register */
#define GTM_TIM6_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104330u)

/** \brief 4334, TIM6 Channel 6 Force Interrupt Register */
#define GTM_TIM6_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104334u)

/** \brief 4338, TIM6 Channel 6 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104338u)

/** \brief 433C, TIM6 Channel 6 Error Interrupt Enable Register */
#define GTM_TIM6_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010433Cu)

/** \brief 4380, TIM6 Channel 7 General Purpose 0 Register */
#define GTM_TIM6_CH7_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104380u)

/** \brief 4384, TIM6 Channel 7 General Purpose 1 Register */
#define GTM_TIM6_CH7_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104384u)

/** \brief 4388, TIM6 Channel 7 SMU Counter Register */
#define GTM_TIM6_CH7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104388u)

/** \brief 438C, TIM6 Channel 7 SMU Edge Counter Register */
#define GTM_TIM6_CH7_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010438Cu)

/** \brief 4390, TIM6 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM6_CH7_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104390u)

/** \brief 4394, TIM6 Channel 7 TDU Counter Register */
#define GTM_TIM6_CH7_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104394u)

/** \brief 4398, TIM6 Channel 7 TDU Control Register */
#define GTM_TIM6_CH7_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104398u)

/** \brief 439C, TIM6 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM6_CH7_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010439Cu)

/** \brief 43A0, TIM6 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM6_CH7_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01043A0u)

/** \brief 43A4, TIM6 Channel 7 Control Register */
#define GTM_TIM6_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01043A4u)

/** \brief 43A8, TIM6 Channel 7 Extended Control Register */
#define GTM_TIM6_CH7_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01043A8u)

/** \brief 43AC, TIM6 Channel 7 Interrupt Notification Register */
#define GTM_TIM6_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01043ACu)

/** \brief 43B0, TIM6 Channel 7 Interrupt Enable Register */
#define GTM_TIM6_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01043B0u)

/** \brief 43B4, TIM6 Channel 7 Force Interrupt Register */
#define GTM_TIM6_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01043B4u)

/** \brief 43B8, TIM6 Channel 7 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01043B8u)

/** \brief 43BC, TIM6 Channel 7 Error Interrupt Enable Register */
#define GTM_TIM6_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01043BCu)

