Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 9928, TOM3 Channel 4 Interrupt Mode Register */
#define GTM_TOM3_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109928u)

/** \brief 9940, TOM3 Channel 5 Control Register */
#define GTM_TOM3_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109940u)

/** \brief 9944, TOM3 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109944u)

/** \brief 9948, TOM3 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109948u)

/** \brief 994C, TOM3 Channel 5 CCU0 Compare Register */
#define GTM_TOM3_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010994Cu)

/** \brief 9950, TOM3 Channel 5 CCU1 Compare Register */
#define GTM_TOM3_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109950u)

/** \brief 9954, TOM3 Channel 5 CCU0 Counter Register */
#define GTM_TOM3_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109954u)

/** \brief 9958, TOM3 Channel 5 Status Register */
#define GTM_TOM3_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109958u)

/** \brief 995C, TOM3 Channel 5 Interrupt Notification Register */
#define GTM_TOM3_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010995Cu)

/** \brief 9960, TOM3 Channel 5 Interrupt Enable Register */
#define GTM_TOM3_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109960u)

/** \brief 9964, TOM3 Channel 5 Force Interrupt Register */
#define GTM_TOM3_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109964u)

/** \brief 9968, TOM3 Channel 5 Interrupt Mode Register */
#define GTM_TOM3_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109968u)

/** \brief 9980, TOM3 Channel 6 Control Register */
#define GTM_TOM3_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109980u)

/** \brief 9984, TOM3 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109984u)

/** \brief 9988, TOM3 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109988u)

/** \brief 998C, TOM3 Channel 6 CCU0 Compare Register */
#define GTM_TOM3_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010998Cu)

/** \brief 9990, TOM3 Channel 6 CCU1 Compare Register */
#define GTM_TOM3_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109990u)

/** \brief 9994, TOM3 Channel 6 CCU0 Counter Register */
#define GTM_TOM3_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109994u)

/** \brief 9998, TOM3 Channel 6 Status Register */
#define GTM_TOM3_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109998u)

/** \brief 999C, TOM3 Channel 6 Interrupt Notification Register */
#define GTM_TOM3_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010999Cu)

/** \brief 99A0, TOM3 Channel 6 Interrupt Enable Register */
#define GTM_TOM3_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01099A0u)

/** \brief 99A4, TOM3 Channel 6 Force Interrupt Register */
#define GTM_TOM3_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01099A4u)

/** \brief 99A8, TOM3 Channel 6 Interrupt Mode Register */
#define GTM_TOM3_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01099A8u)

/** \brief 99C0, TOM3 Channel 7 Control Register */
#define GTM_TOM3_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01099C0u)

/** \brief 99C4, TOM3 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01099C4u)

/** \brief 99C8, TOM3 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01099C8u)

/** \brief 99CC, TOM3 Channel 7 CCU0 Compare Register */
#define GTM_TOM3_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01099CCu)

/** \brief 99D0, TOM3 Channel 7 CCU1 Compare Register */
#define GTM_TOM3_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01099D0u)

/** \brief 99D4, TOM3 Channel 7 CCU0 Counter Register */
#define GTM_TOM3_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01099D4u)

/** \brief 99D8, TOM3 Channel 7 Status Register */
#define GTM_TOM3_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01099D8u)

/** \brief 99DC, TOM3 Channel 7 Interrupt Notification Register */
#define GTM_TOM3_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01099DCu)

/** \brief 99E0, TOM3 Channel 7 Interrupt Enable Register */
#define GTM_TOM3_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01099E0u)

/** \brief 99E4, TOM3 Channel 7 Force Interrupt Register */
#define GTM_TOM3_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01099E4u)

/** \brief 99E8, TOM3 Channel 7 Interrupt Mode Register */
#define GTM_TOM3_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01099E8u)

/** \brief 9A00, TOM3 Channel 8 Control Register */
#define GTM_TOM3_CH8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109A00u)

/** \brief 9A04, TOM3 Channel 8 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH8_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109A04u)

/** \brief 9A08, TOM3 Channel 8 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH8_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109A08u)

/** \brief 9A0C, TOM3 Channel 8 CCU0 Compare Register */
#define GTM_TOM3_CH8_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109A0Cu)

/** \brief 9A10, TOM3 Channel 8 CCU1 Compare Register */
#define GTM_TOM3_CH8_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109A10u)

/** \brief 9A14, TOM3 Channel 8 CCU0 Counter Register */
#define GTM_TOM3_CH8_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109A14u)

/** \brief 9A18, TOM3 Channel 8 Status Register */
#define GTM_TOM3_CH8_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109A18u)

/** \brief 9A1C, TOM3 Channel 8 Interrupt Notification Register */
#define GTM_TOM3_CH8_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109A1Cu)

/** \brief 9A20, TOM3 Channel 8 Interrupt Enable Register */
#define GTM_TOM3_CH8_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109A20u)

/** \brief 9A24, TOM3 Channel 8 Force Interrupt Register */
#define GTM_TOM3_CH8_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109A24u)

