Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 1C464, FIFO1 Channel 1 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C464u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH1_IRQ_NOTIFY (GTM_PSM1_FIFO_CH1_IRQ_NOTIFY)

/** \brief 1C468, FIFO1 Channel 1 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C468u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_IRQ_EN.
*/
#define GTM_FIFO1_CH1_IRQ_EN (GTM_PSM1_FIFO_CH1_IRQ_EN)

/** \brief 1C46C, FIFO1 Channel 1 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C46Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH1_IRQ_FORCINT (GTM_PSM1_FIFO_CH1_IRQ_FORCINT)

/** \brief 1C470, FIFO1 Channel 1 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C470u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_IRQ_MODE.
*/
#define GTM_FIFO1_CH1_IRQ_MODE (GTM_PSM1_FIFO_CH1_IRQ_MODE)

/** \brief 1C474, FIFO1 Channel 1 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C474u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_EIRQ_EN.
*/
#define GTM_FIFO1_CH1_EIRQ_EN (GTM_PSM1_FIFO_CH1_EIRQ_EN)

/** \brief 1C480, FIFO1 Channel 2 Control Register */
#define GTM_PSM1_FIFO_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C480u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_CTRL.
*/
#define GTM_FIFO1_CH2_CTRL (GTM_PSM1_FIFO_CH2_CTRL)

/** \brief 1C484, FIFO1 Channel 2 End Address Register */
#define GTM_PSM1_FIFO_CH2_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C484u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_END_ADDR.
*/
#define GTM_FIFO1_CH2_END_ADDR (GTM_PSM1_FIFO_CH2_END_ADDR)

/** \brief 1C488, FIFO1 Channel 2 Start Address Register */
#define GTM_PSM1_FIFO_CH2_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C488u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_START_ADDR.
*/
#define GTM_FIFO1_CH2_START_ADDR (GTM_PSM1_FIFO_CH2_START_ADDR)

/** \brief 1C48C, FIFO1 Channel 2 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH2_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C48Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_UPPER_WM.
*/
#define GTM_FIFO1_CH2_UPPER_WM (GTM_PSM1_FIFO_CH2_UPPER_WM)

/** \brief 1C490, FIFO1 Channel 2 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH2_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C490u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_LOWER_WM.
*/
#define GTM_FIFO1_CH2_LOWER_WM (GTM_PSM1_FIFO_CH2_LOWER_WM)

/** \brief 1C494, FIFO1 Channel 2 Status Register */
#define GTM_PSM1_FIFO_CH2_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C494u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_STATUS.
*/
#define GTM_FIFO1_CH2_STATUS (GTM_PSM1_FIFO_CH2_STATUS)

/** \brief 1C498, FIFO1 Channel 2 Fill Level Register */
#define GTM_PSM1_FIFO_CH2_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C498u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_FILL_LEVEL.
*/
#define GTM_FIFO1_CH2_FILL_LEVEL (GTM_PSM1_FIFO_CH2_FILL_LEVEL)

/** \brief 1C49C, FIFO1 Channel 2 Write Pointer Register */
#define GTM_PSM1_FIFO_CH2_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C49Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_WR_PTR.
*/
#define GTM_FIFO1_CH2_WR_PTR (GTM_PSM1_FIFO_CH2_WR_PTR)

/** \brief 1C4A0, FIFO1 Channel 2 Read Pointer Register */
#define GTM_PSM1_FIFO_CH2_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C4A0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_RD_PTR.
*/
#define GTM_FIFO1_CH2_RD_PTR (GTM_PSM1_FIFO_CH2_RD_PTR)

/** \brief 1C4A4, FIFO1 Channel 2 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C4A4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH2_IRQ_NOTIFY (GTM_PSM1_FIFO_CH2_IRQ_NOTIFY)

/** \brief 1C4A8, FIFO1 Channel 2 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C4A8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_IRQ_EN.
*/
#define GTM_FIFO1_CH2_IRQ_EN (GTM_PSM1_FIFO_CH2_IRQ_EN)

