Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief 9FF20, MSC Set 2 Control 0 Register */
#define GTM_MSC_SET2_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF20u)
/** Alias (User Manual Name) for GTM_MSC_SET2_CON0.
* To use register names with standard convension, please use GTM_MSC_SET2_CON0.
*/
#define GTM_MSCSET2CON0 (GTM_MSC_SET2_CON0)

/** \brief 9FF24, MSC Set 2 Control 1 Register */
#define GTM_MSC_SET2_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF24u)
/** Alias (User Manual Name) for GTM_MSC_SET2_CON1.
* To use register names with standard convension, please use GTM_MSC_SET2_CON1.
*/
#define GTM_MSCSET2CON1 (GTM_MSC_SET2_CON1)

/** \brief 9FF28, MSC Set 2 Control 2 Register */
#define GTM_MSC_SET2_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF28u)
/** Alias (User Manual Name) for GTM_MSC_SET2_CON2.
* To use register names with standard convension, please use GTM_MSC_SET2_CON2.
*/
#define GTM_MSCSET2CON2 (GTM_MSC_SET2_CON2)

/** \brief 9FF2C, MSC Set 2 Control 3 Register */
#define GTM_MSC_SET2_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF2Cu)
/** Alias (User Manual Name) for GTM_MSC_SET2_CON3.
* To use register names with standard convension, please use GTM_MSC_SET2_CON3.
*/
#define GTM_MSCSET2CON3 (GTM_MSC_SET2_CON3)

/** \brief 9FF30, MSC Set 3 Control 0 Register */
#define GTM_MSC_SET3_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF30u)
/** Alias (User Manual Name) for GTM_MSC_SET3_CON0.
* To use register names with standard convension, please use GTM_MSC_SET3_CON0.
*/
#define GTM_MSCSET3CON0 (GTM_MSC_SET3_CON0)

/** \brief 9FF34, MSC Set 3 Control 1 Register */
#define GTM_MSC_SET3_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF34u)
/** Alias (User Manual Name) for GTM_MSC_SET3_CON1.
* To use register names with standard convension, please use GTM_MSC_SET3_CON1.
*/
#define GTM_MSCSET3CON1 (GTM_MSC_SET3_CON1)

/** \brief 9FF38, MSC Set 3 Control 2 Register */
#define GTM_MSC_SET3_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF38u)
/** Alias (User Manual Name) for GTM_MSC_SET3_CON2.
* To use register names with standard convension, please use GTM_MSC_SET3_CON2.
*/
#define GTM_MSCSET3CON2 (GTM_MSC_SET3_CON2)

/** \brief 9FF3C, MSC Set 3 Control 3 Register */
#define GTM_MSC_SET3_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF3Cu)
/** Alias (User Manual Name) for GTM_MSC_SET3_CON3.
* To use register names with standard convension, please use GTM_MSC_SET3_CON3.
*/
#define GTM_MSCSET3CON3 (GTM_MSC_SET3_CON3)

/** \brief 9FF40, MSC Set 4 Control 0 Register */
#define GTM_MSC_SET4_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF40u)
/** Alias (User Manual Name) for GTM_MSC_SET4_CON0.
* To use register names with standard convension, please use GTM_MSC_SET4_CON0.
*/
#define GTM_MSCSET4CON0 (GTM_MSC_SET4_CON0)

/** \brief 9FF44, MSC Set 4 Control 1 Register */
#define GTM_MSC_SET4_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF44u)
/** Alias (User Manual Name) for GTM_MSC_SET4_CON1.
* To use register names with standard convension, please use GTM_MSC_SET4_CON1.
*/
#define GTM_MSCSET4CON1 (GTM_MSC_SET4_CON1)

/** \brief 9FF48, MSC Set 4 Control 2 Register */
#define GTM_MSC_SET4_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF48u)
/** Alias (User Manual Name) for GTM_MSC_SET4_CON2.
* To use register names with standard convension, please use GTM_MSC_SET4_CON2.
*/
#define GTM_MSCSET4CON2 (GTM_MSC_SET4_CON2)

/** \brief 9FF4C, MSC Set 4 Control 3 Register */
#define GTM_MSC_SET4_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF4Cu)
/** Alias (User Manual Name) for GTM_MSC_SET4_CON3.
* To use register names with standard convension, please use GTM_MSC_SET4_CON3.
*/
#define GTM_MSCSET4CON3 (GTM_MSC_SET4_CON3)

/** \brief 9FF50, MSC Set 5 Control 0 Register */
#define GTM_MSC_SET5_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF50u)
/** Alias (User Manual Name) for GTM_MSC_SET5_CON0.
* To use register names with standard convension, please use GTM_MSC_SET5_CON0.
*/
#define GTM_MSCSET5CON0 (GTM_MSC_SET5_CON0)

/** \brief 9FF54, MSC Set 5 Control 1 Register */
#define GTM_MSC_SET5_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF54u)
/** Alias (User Manual Name) for GTM_MSC_SET5_CON1.
* To use register names with standard convension, please use GTM_MSC_SET5_CON1.
*/
#define GTM_MSCSET5CON1 (GTM_MSC_SET5_CON1)

/** \brief 9FF58, MSC Set 5 Control 2 Register */
#define GTM_MSC_SET5_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF58u)
/** Alias (User Manual Name) for GTM_MSC_SET5_CON2.
* To use register names with standard convension, please use GTM_MSC_SET5_CON2.
*/
#define GTM_MSCSET5CON2 (GTM_MSC_SET5_CON2)

/** \brief 9FF5C, MSC Set 5 Control 3 Register */
#define GTM_MSC_SET5_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF5Cu)
/** Alias (User Manual Name) for GTM_MSC_SET5_CON3.
* To use register names with standard convension, please use GTM_MSC_SET5_CON3.
*/
#define GTM_MSCSET5CON3 (GTM_MSC_SET5_CON3)

/** \brief 9FF60, MSC Set 6 Control 0 Register */
#define GTM_MSC_SET6_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF60u)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON0.
* To use register names with standard convension, please use GTM_MSC_SET6_CON0.
*/
#define GTM_MSCSET6CON0 (GTM_MSC_SET6_CON0)

/** \brief 9FF64, MSC Set 6 Control 1 Register */
#define GTM_MSC_SET6_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF64u)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON1.
* To use register names with standard convension, please use GTM_MSC_SET6_CON1.
*/
#define GTM_MSCSET6CON1 (GTM_MSC_SET6_CON1)

/** \brief 9FF68, MSC Set 6 Control 2 Register */
#define GTM_MSC_SET6_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF68u)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON2.
* To use register names with standard convension, please use GTM_MSC_SET6_CON2.
*/
#define GTM_MSCSET6CON2 (GTM_MSC_SET6_CON2)

