Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief EA984, ATOM5 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM5_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA984u)

/** \brief EA984, ATOM5 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM5_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA984u)

/** \brief EA984, ATOM5 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM5_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA984u)

/** \brief EA984, ATOM5 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM5_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA984u)

/** \brief EA988, ATOM5 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA988u)

/** \brief EA98C, ATOM5 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA98Cu)

/** \brief EA990, ATOM5 Channel 3 CCU0 Compare Register */
#define GTM_ATOM5_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA990u)

/** \brief EA994, ATOM5 Channel 3 CCU1 Compare Register */
#define GTM_ATOM5_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA994u)

/** \brief EA998, ATOM5 Channel 3 CCU0 Counter Register */
#define GTM_ATOM5_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA998u)

/** \brief EA99C, ATOM5 Channel 3 Status Register */
#define GTM_ATOM5_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA99Cu)

/** \brief EA9A0, ATOM5 Channel 3 Interrupt Notification Register */
#define GTM_ATOM5_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA9A0u)

/** \brief EA9A4, ATOM5 Channel 3 Interrupt Enable Register */
#define GTM_ATOM5_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA9A4u)

/** \brief EA9A8, ATOM5 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM5_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA9A8u)

/** \brief EA9AC, ATOM5 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA9ACu)

/** \brief EAA00, ATOM5 Channel 4 ARU read address Register */
#define GTM_ATOM5_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EAA00u)

/** \brief EAA04, ATOM5 Channel 4 Control Register */
#define GTM_ATOM5_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EAA04u)

/** \brief EAA04, ATOM5 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM5_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EAA04u)

/** \brief EAA04, ATOM5 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM5_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EAA04u)

/** \brief EAA04, ATOM5 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM5_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EAA04u)

/** \brief EAA04, ATOM5 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM5_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EAA04u)

/** \brief EAA04, ATOM5 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM5_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EAA04u)

/** \brief EAA08, ATOM5 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EAA08u)

/** \brief EAA0C, ATOM5 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EAA0Cu)

/** \brief EAA10, ATOM5 Channel 4 CCU0 Compare Register */
#define GTM_ATOM5_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EAA10u)

/** \brief EAA14, ATOM5 Channel 4 CCU1 Compare Register */
#define GTM_ATOM5_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EAA14u)

/** \brief EAA18, ATOM5 Channel 4 CCU0 Counter Register */
#define GTM_ATOM5_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EAA18u)

/** \brief EAA1C, ATOM5 Channel 4 Status Register */
#define GTM_ATOM5_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EAA1Cu)

/** \brief EAA20, ATOM5 Channel 4 Interrupt Notification Register */
#define GTM_ATOM5_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EAA20u)

/** \brief EAA24, ATOM5 Channel 4 Interrupt Enable Register */
#define GTM_ATOM5_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EAA24u)

/** \brief EAA28, ATOM5 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM5_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EAA28u)

/** \brief EAA2C, ATOM5 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EAA2Cu)

/** \brief EAA80, ATOM5 Channel 5 ARU read address Register */
#define GTM_ATOM5_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EAA80u)

/** \brief EAA84, ATOM5 Channel 5 Control Register */
#define GTM_ATOM5_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EAA84u)

/** \brief EAA84, ATOM5 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM5_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EAA84u)

/** \brief EAA84, ATOM5 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM5_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EAA84u)

/** \brief EAA84, ATOM5 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM5_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EAA84u)

/** \brief EAA84, ATOM5 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM5_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EAA84u)

/** \brief EAA84, ATOM5 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM5_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EAA84u)

/** \brief EAA88, ATOM5 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EAA88u)

/** \brief EAA8C, ATOM5 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EAA8Cu)

