Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief EC214, ATOM8 Channel 4 CCU1 Compare Register */
#define GTM_ATOM8_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC214u)

/** \brief EC218, ATOM8 Channel 4 CCU0 Counter Register */
#define GTM_ATOM8_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC218u)

/** \brief EC21C, ATOM8 Channel 4 Status Register */
#define GTM_ATOM8_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC21Cu)

/** \brief EC220, ATOM8 Channel 4 Interrupt Notification Register */
#define GTM_ATOM8_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC220u)

/** \brief EC224, ATOM8 Channel 4 Interrupt Enable Register */
#define GTM_ATOM8_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC224u)

/** \brief EC228, ATOM8 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM8_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC228u)

/** \brief EC22C, ATOM8 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC22Cu)

/** \brief EC280, ATOM8 Channel 5 ARU read address Register */
#define GTM_ATOM8_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC280u)

/** \brief EC284, ATOM8 Channel 5 Control Register */
#define GTM_ATOM8_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC284u)

/** \brief EC284, ATOM8 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM8_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC284u)

/** \brief EC284, ATOM8 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM8_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC284u)

/** \brief EC284, ATOM8 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM8_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC284u)

/** \brief EC284, ATOM8 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM8_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC284u)

/** \brief EC284, ATOM8 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM8_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC284u)

/** \brief EC288, ATOM8 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC288u)

/** \brief EC28C, ATOM8 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC28Cu)

/** \brief EC290, ATOM8 Channel 5 CCU0 Compare Register */
#define GTM_ATOM8_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC290u)

/** \brief EC294, ATOM8 Channel 5 CCU1 Compare Register */
#define GTM_ATOM8_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC294u)

/** \brief EC298, ATOM8 Channel 5 CCU0 Counter Register */
#define GTM_ATOM8_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC298u)

/** \brief EC29C, ATOM8 Channel 5 Status Register */
#define GTM_ATOM8_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC29Cu)

/** \brief EC2A0, ATOM8 Channel 5 Interrupt Notification Register */
#define GTM_ATOM8_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC2A0u)

/** \brief EC2A4, ATOM8 Channel 5 Interrupt Enable Register */
#define GTM_ATOM8_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC2A4u)

/** \brief EC2A8, ATOM8 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM8_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC2A8u)

/** \brief EC2AC, ATOM8 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC2ACu)

/** \brief EC300, ATOM8 Channel 6 ARU read address Register */
#define GTM_ATOM8_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC300u)

/** \brief EC304, ATOM8 Channel 6 Control Register */
#define GTM_ATOM8_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC304u)

/** \brief EC304, ATOM8 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM8_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC304u)

/** \brief EC304, ATOM8 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM8_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC304u)

/** \brief EC304, ATOM8 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM8_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC304u)

/** \brief EC304, ATOM8 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM8_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC304u)

/** \brief EC304, ATOM8 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM8_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC304u)

/** \brief EC308, ATOM8 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC308u)

/** \brief EC30C, ATOM8 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC30Cu)

/** \brief EC310, ATOM8 Channel 6 CCU0 Compare Register */
#define GTM_ATOM8_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC310u)

/** \brief EC314, ATOM8 Channel 6 CCU1 Compare Register */
#define GTM_ATOM8_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC314u)

/** \brief EC318, ATOM8 Channel 6 CCU0 Counter Register */
#define GTM_ATOM8_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC318u)

/** \brief EC31C, ATOM8 Channel 6 Status Register */
#define GTM_ATOM8_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC31Cu)

/** \brief EC320, ATOM8 Channel 6 Interrupt Notification Register */
#define GTM_ATOM8_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC320u)

/** \brief EC324, ATOM8 Channel 6 Interrupt Enable Register */
#define GTM_ATOM8_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC324u)

/** \brief EC328, ATOM8 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM8_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC328u)

