Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxGtm_reg.h
/** \brief F50D4, MCS5 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS5_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F50D4u)

/** \brief F5100, MCS5 Channel 2 General Purpose Register 0 */
#define GTM_MCS5_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5100u)

/** \brief F5104, MCS5 Channel 2 General Purpose Register 1 */
#define GTM_MCS5_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5104u)

/** \brief F5108, MCS5 Channel 2 General Purpose Register 2 */
#define GTM_MCS5_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5108u)

/** \brief F510C, MCS5 Channel 2 General Purpose Register 3 */
#define GTM_MCS5_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F510Cu)

/** \brief F5110, MCS5 Channel 2 General Purpose Register 4 */
#define GTM_MCS5_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5110u)

/** \brief F5114, MCS5 Channel 2 General Purpose Register 5 */
#define GTM_MCS5_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5114u)

/** \brief F5118, MCS5 Channel 2 General Purpose Register 6 */
#define GTM_MCS5_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5118u)

/** \brief F511C, MCS5 Channel 2 General Purpose Register 7 */
#define GTM_MCS5_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F511Cu)

/** \brief F5120, MCS5 Channel 2 Control Register */
#define GTM_MCS5_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5120u)

/** \brief F5124, MCS5 Channel 2 ARU Control Bit Register */
#define GTM_MCS5_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5124u)

/** \brief F513C, MCS5 Channel 2 Memory High Byte Register */
#define GTM_MCS5_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F513Cu)

/** \brief F5140, MCS5 Channel 2 Program Counter Register */
#define GTM_MCS5_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F5140u)

/** \brief F5144, MCS5 Channel 2 Interrupt Notification Register */
#define GTM_MCS5_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F5144u)

/** \brief F5148, MCS5 Channel 2 Interrupt Enable Register */
#define GTM_MCS5_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F5148u)

/** \brief F514C, MCS5 Channel 2 Force Interrupt Register */
#define GTM_MCS5_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F514Cu)

/** \brief F5150, MCS5 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F5150u)

/** \brief F5154, MCS5 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS5_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F5154u)

/** \brief F5180, MCS5 Channel 3 General Purpose Register 0 */
#define GTM_MCS5_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5180u)

/** \brief F5184, MCS5 Channel 3 General Purpose Register 1 */
#define GTM_MCS5_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5184u)

/** \brief F5188, MCS5 Channel 3 General Purpose Register 2 */
#define GTM_MCS5_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5188u)

/** \brief F518C, MCS5 Channel 3 General Purpose Register 3 */
#define GTM_MCS5_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F518Cu)

/** \brief F5190, MCS5 Channel 3 General Purpose Register 4 */
#define GTM_MCS5_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5190u)

/** \brief F5194, MCS5 Channel 3 General Purpose Register 5 */
#define GTM_MCS5_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5194u)

/** \brief F5198, MCS5 Channel 3 General Purpose Register 6 */
#define GTM_MCS5_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5198u)

/** \brief F519C, MCS5 Channel 3 General Purpose Register 7 */
#define GTM_MCS5_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F519Cu)

/** \brief F51A0, MCS5 Channel 3 Control Register */
#define GTM_MCS5_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F51A0u)

/** \brief F51A4, MCS5 Channel 3 ARU Control Bit Register */
#define GTM_MCS5_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F51A4u)

/** \brief F51BC, MCS5 Channel 3 Memory High Byte Register */
#define GTM_MCS5_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F51BCu)

/** \brief F51C0, MCS5 Channel 3 Program Counter Register */
#define GTM_MCS5_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F51C0u)

/** \brief F51C4, MCS5 Channel 3 Interrupt Notification Register */
#define GTM_MCS5_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F51C4u)

/** \brief F51C8, MCS5 Channel 3 Interrupt Enable Register */
#define GTM_MCS5_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F51C8u)

/** \brief F51CC, MCS5 Channel 3 Force Interrupt Register */
#define GTM_MCS5_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F51CCu)

/** \brief F51D0, MCS5 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F51D0u)

/** \brief F51D4, MCS5 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS5_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F51D4u)

/** \brief F5200, MCS5 Channel 4 General Purpose Register 0 */
#define GTM_MCS5_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5200u)

/** \brief F5204, MCS5 Channel 4 General Purpose Register 1 */
#define GTM_MCS5_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5204u)

/** \brief F5208, MCS5 Channel 4 General Purpose Register 2 */
#define GTM_MCS5_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5208u)

/** \brief F520C, MCS5 Channel 4 General Purpose Register 3 */
#define GTM_MCS5_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F520Cu)

/** \brief F5210, MCS5 Channel 4 General Purpose Register 4 */
#define GTM_MCS5_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5210u)

/** \brief F5214, MCS5 Channel 4 General Purpose Register 5 */
#define GTM_MCS5_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5214u)

/** \brief F5218, MCS5 Channel 4 General Purpose Register 6 */
#define GTM_MCS5_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5218u)

/** \brief F521C, MCS5 Channel 4 General Purpose Register 7 */
#define GTM_MCS5_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F521Cu)

/** \brief F5220, MCS5 Channel 4 Control Register */
#define GTM_MCS5_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5220u)

/** \brief F5224, MCS5 Channel 4 ARU Control Bit Register */
#define GTM_MCS5_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5224u)

/** \brief F523C, MCS5 Channel 4 Memory High Byte Register */
#define GTM_MCS5_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F523Cu)

